package additional.ht5;

import java.util.Stack;

/**
 * Вам даны два непустых массива A и B, состоящих из N целых чисел.
 * Массивы A и B представляют N прожорливых рыб в реке, упорядоченных вниз по течению реки.
 *
 * Рыбы пронумерованы от 0 до N - 1. Если P и Q - две рыбы и P < Q,
 * то рыба P изначально находится выше по течению от рыбы Q.
 * Изначально каждая рыба занимает уникальное положение.
 *
 * Число рыб P обозначается буквами A [P] и B [P]. Массив A содержит размеры рыбы.
 * Все его элементы уникальны. Массив B содержит направления движения рыбы.
 * Он содержит только нули и/или единицы, где:
 * 0 - представляет рыбу, плывущую вверх по течению,
 * 1 - изображает рыбу, плывущую вниз по течению.
 *
 * Если две рыбы движутся в противоположных направлениях и между ними нет другой (живой) рыбы, они в конечном
 * итоге встретятся друг с другом. Тогда в живых может остаться только одна рыба - большая рыба поедает меньшую.
 * Точнее, мы говорим, что две рыбы P и Q встречаются, когда P <Q, B [P] = 1 и B [Q] = 0, и между ними нет живых рыб.
 *
 * После встречи:
 *
 * Если A [P] > A [Q], тогда P ест Q, и P по-прежнему будет течь вниз по потоку,
 * Если A [Q] > A [P], тогда Q ест P, и Q все равно будет течь вверх по течению.
 * Предполагается, что все рыбы движутся с одинаковой скоростью.
 * То есть рыбы, движущиеся в одном направлении, никогда не встречаются.
 * Цель состоит в том, чтобы подсчитать количество рыб, которые останутся в живых.
 *
 * Например, рассмотрим массивы A и B такие, что:
 *
 * A[0] = 4    B[0] = 0
 * A[1] = 3    B[1] = 1
 * A[2] = 2    B[2] = 0
 * A[3] = 1    B[3] = 0
 * A[4] = 5    B[4] = 0
 *
 * Изначально все рыбы живы и все, кроме рыбы №1, движутся вверх по течению.
 * Рыба № 1 встречает рыбу № 2 и ест ее, затем она встречает рыбу № 3 и тоже ест ее.
 * Наконец, он встречает рыбу номер 4 и съедается ею. Остальные две рыбы, номер 0 и 4,
 * никогда не встречаются и поэтому остаются в живых.
 *
 * Напишите функцию:
 *
 * class Solution {
 * public int solution(int[] A, int[] B);
 * }
 *
 * это, учитывая два непустых массива A и B, состоящих из N целых чисел,
 * возвращает количество рыб, которые останутся в живых.
 *
 * Например, с учетом массивов, показанных выше, функция должна вернуть 2, как объяснено выше.
 *
 * Напишите эффективный алгоритм для следующих предположений:
 * N - целое число в диапазоне [1..100 000];
 * каждый элемент массива A является целым числом в диапазоне [0..1,000,000,000];
 * каждый элемент массива B является целым числом, которое может иметь одно из следующих значений: 0, 1;
 * все элементы A различны.
 */

public class Solution {

    public static int solution(int[] A, int[] B) {

        int numberOfFish = A.length;

        if (A.length == 0) {
            return 0;
        }

        Stack<Integer> fishStack = new Stack<>();

        for (int i = 0; i < A.length; i++) {
            if (B[i] == 1) {
                fishStack.push(A[i]);
            }
            if (B[i] == 0) {
                while (!fishStack.isEmpty()) {
                    if (fishStack.peek() > A[i]) {
                        numberOfFish--;
                        break;
                    } else if (fishStack.peek() < A[i]) {
                        fishStack.pop();
                        numberOfFish--;
                    }
                }

            }
        }
        return numberOfFish;
    }
}
